app/controllers/challenge_controller.rb

SELECT "challenges".* FROM "challenges" WHERE "challenges"."challenger_id" IS NULL AND "challenges"."challengee_id" = 4 AND "challenges"."accepted" = 'f' LIMIT 1
---
  def accept_challenge
    challenge = Challenge.find_by_challenger_id_and_challengee_id_and_accepted(accept_challenge_params[:challenger_id], @logged_user.id, false)

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 5 AND "challenges"."accepted" = 't' LIMIT 1
SELECT "challenge_shots".* FROM "challenge_shots" WHERE (user_id = 4 AND challenge_id = 4)
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 4 LIMIT 1
DELETE FROM "challenge_shots" WHERE "challenge_shots"."id" = ?  [["id", 11]]
DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 4]]
---
  def quit_challenge_api
    challenge = Challenge.find_by_id_and_accepted(quit_challenge_params[:challenge_id], true)
    unless challenge.blank?
      begin
        challenge_shot = Challenge_Shot.where('user_id = ? AND challenge_id = ?', @logged_user.id, challenge.id)
        challenge_shot.each do |cs|
          cs.destroy!
        end
        challenge.destroy!

SELECT "challenges".* FROM "challenges" WHERE (challenger_id=1 OR challengee_id=1)
SELECT COUNT(*) FROM "challenge_shots" WHERE (user_id = 4 AND challenge_id = 2)
---
  def get_challenges
    @challenges = @logged_user.challenges
    challenge_details = Hash.new []
    array = []
    @challenges.each do |challenge|
      this_shots = Challenge_Shot.where('user_id = ? AND challenge_id = ?', @logged_user.id, challenge.id)
      that_shots = Challenge_Shot.where('user_id = ? AND challenge_id = ?', challenge.challengee_id == @logged_user.id ? challenge.challenger_id : challenge.challengee_id, challenge.id)
      challenge_hash = {:id => challenge.id, :challenger_id => challenge.challenger_id, :challengee_id => challenge.challengee_id, :accepted => challenge.accepted, :created_at => challenge.created_at, :updated_at => challenge.updated_at, :this_user_count => this_shots.count, :that_user_count => that_shots.count}

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "challenges".* FROM "challenges" WHERE (challenger_id=4 OR challengee_id=4)
---
  def challenge_player
    player = User.find_by_id(challenge_params[:player_id])

    # Check for an existing challenge
    @logged_user.challenges.each do |ch|