app/controllers/friendship_controller.rb

  def accept_friend_api
    friendship = Friendship.find_by_friend_id_and_user_id(@logged_user.id, invite_params[:friend_id])
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = 2 AND "friendships"."user_id" = 6 LIMIT 1

  def invite_friend_api
    friend = User.find_by_email(params[:search_term].downcase)
    friend = User.find_by_username(params[:search_term].downcase) unless !friend.nil?
    friend = User.find_by_phone(params[:search_term].downcase) unless !friend.nil?
---
SELECT "users".* FROM "users" WHERE "users"."email" = 's' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."username" = 's' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."phone" = 's' LIMIT 1