app/controllers/shot_controller.rb

SELECT "friendships".* FROM "friendships" WHERE ((user_id=2 OR friend_id=2) AND accepted='t')
SELECT "shots".* FROM "shots" WHERE "shots"."user_id" = ?  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def get_shots_api
    challenge_details = Hash.new []
    @shots = @logged_user.shots
    array = []
    @friends = Friendship.where('(user_id=? OR friend_id=?) AND accepted=?', @logged_user.id, @logged_user.id, true)
    @friends.each do |f|
      who_id = f.user_id == @logged_user.id ? f.friend_id : f.user_id
      user = User.find_by_id(who_id)

INSERT INTO "shots" ("caption", "created_at", "s3url", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
SELECT "challenges".* FROM "challenges" WHERE ((challengee_id = 4 OR challenger_id = 4) AND accepted = 't')
INSERT INTO "challenge_shots" ("challenge_id", "created_at", "shot_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["challenge_id", 3], ["created_at", Fri, 12 Sep 2014 12:05:35 UTC +00:00], ["shot_id", 19], ["updated_at", Fri, 12 Sep 2014 12:05:35 UTC +00:00], ["user_id", 4]]
SELECT COUNT(*) FROM "challenge_shots" WHERE (user_id = 4 AND challenge_id = 2)
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def post_shot_api
    @shot = Shot.new(:caption => shot_params[:caption], :s3url => shot_params[:s3url], :user_id => @logged_user.id)
    @shot.save()
    @user_challenges = Challenge.where('(challengee_id = ? OR challenger_id = ?) AND accepted = ?', @logged_user.id, @logged_user.id, true)
    array = []
    if !@user_challenges.blank?
      challenge_details = Hash.new []
      @user_challenges.each do |challenge|
        challenge_shot = Challenge_Shot.new(:challenge_id => challenge.id, :shot_id => @shot.id, :user_id => @logged_user.id)
        challenge_shot.save()
        challenge_hash = {}
        challenge_hash["challenge"] = challenge
        cShots = Challenge_Shot.where('user_id = ? AND challenge_id = ?', @logged_user.id, challenge.id)
        challenge_hash["shots_count"] = cShots.count
        array.push(challenge_hash)

        #who is to send push notification
        user_id = @logged_user.id == challenge.challengee_id ? challenge.challenger_id : challenge.challengee_id
        user = User.find_by_id(user_id)

SELECT "shots".* FROM "shots" WHERE "shots"."id" = 25 AND "shots"."user_id" = 4 LIMIT 1
SELECT "challenge_shots".* FROM "challenge_shots" WHERE (user_id = 4 AND shot_id = 25)
DELETE FROM "challenge_shots" WHERE "challenge_shots"."id" = ?  [["id", 8]]
DELETE FROM "shots" WHERE "shots"."id" = ?  [["id", 25]]
---
  def delete_shot_api
    shot = Shot.find_by_id_and_user_id(delete_shot_params[:shot_id], @logged_user.id)
    unless shot.blank?
      begin
        challenge_shot = Challenge_Shot.where('user_id = ? AND shot_id = ?', @logged_user.id, shot.id)
        challenge_shot.each do |cs|
          challenge = Challenge.find_by_id(cs.challenge_id)
          user_id = @logged_user.id == challenge.challengee_id ? challenge.challenger_id : challenge.challengee_id
          user = User.find_by_id(user_id)
          cs.destroy!
          cShots = Challenge_Shot.where('user_id = ? AND challenge_id = ?', @logged_user.id, challenge.id)
          PushController.push_message_to_user "#{@logged_user.username} has deleted a Bug shot against the challenge. His Bug shot count is #{cShots.count}", user
        end
        shot.destroy!