app/controllers/user_controller.rb

  def register_api
    begin
      @user = User.create(register_api_params)
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "phone", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def update_profile
    @find_user = User.find_by_auth_token(params[:auth_token]) unless params[:auth_token].nil?
    if @find_user.nil?
      error "No such user found."
    else
      begin
        @find_user.username = params[:username]
        @find_user.email = params[:email]
        @find_user.phone = params[:phone]
        @find_user.save(:validate => false)
---
SELECT "users".* FROM "users" WHERE "users"."auth_token" = '23232' LIMIT 1
UPDATE "users" SET "email" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["email", "todd1"], ["phone", "todd1"], ["updated_at", Wed, 10 Sep 2014 15:36:02 UTC +00:00]]

  def update_password
    @user = User.find_by_auth_token(params[:auth_token]) unless params[:auth_token].nil?
    if @user.valid_password?(params[:old_password])
      begin
        @user.password = params[:new_password]
        @user.save(:validate => true)
---
SELECT "users".* FROM "users" WHERE "users"."auth_token" = 'qdMrGFaPjuxsfbCBiU-4' LIMIT 1
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = 7  [["encrypted_password", "$2a$10$U/2DDR2LnWVvMOvnjwBdFOJH5M/9WQsGopNZrieteH6uFEujCAdv."], ["updated_at", Wed, 10 Sep 2014 15:58:45 UTC +00:00]]

  def login_api
    @user = User.find_for_database_authentication({:username => params[:username].downcase})
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'saqib' ORDER BY "users"."id" ASC LIMIT 1

  def update_device_token
    @user = User.find_by_auth_token(params[:auth_token]) unless params[:auth_token].nil?
    if (!@user.nil?)
      begin
        @user.update_attribute('device_token', device_token_api_params[:device_token])
---
SELECT "users".* FROM "users" WHERE "users"."auth_token" = 'HDFXcXB-WNczh7Huo9_F' LIMIT 1
UPDATE "users" SET "device_token" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["device_token", "toddeeeea2"], ["updated_at", Thu, 09 Oct 2014 12:48:08 UTC +00:00]]